---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FabricWireType
source: html/7b18c752-6ea7-6e55-eb24-3509b864731d.htm
---
# FabricWireType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.